Melting/validatin_ga/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)             // 0
    (0.0889 0 0)       // 1
    (0.0889 0.0635 0)        // 2
    (0 0.0635 0)       // 3
    (0 0 0.001) // 4
    (0.0889 0 0.001)  // 5
    (0.0889 0.0635 0.001)        // 6
    (0 0.0635 0.001)  // 7
    (0 0.0635 0.001)   // 8
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 60 1) simpleGrading (1 1 1)
    //hex (1 2 5 4 1 2 5 4) (80 60 1) simpleGrading (4 4 1)
    //hex (3 4 7 6 3 4 7 6) (80 60 1) simpleGrading (4 4 1)
    //hex (4 5 8 7 4 5 8 7) (80 60 1) simpleGrading (4 4 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    rightWall
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    upperWall
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }

    lowerWall
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
